---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.LoadFailures.CannotRotateLoad
source: html/b4ec5a5e-be9b-9ca6-e469-68aa89a3396d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.LoadFailures.CannotRotateLoad Property

Can't rotate Load because rotation axis is not perpendicular to sketch plane.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotRotateLoad { get; }
```